rheoTool/tutorials/rheoFoam/fluidDamper/CarreauYasuda/0/pointMotionUx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       pointScalarField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     left
    {
        type            fixedValue;
	value           uniform 0;
    }

    right
    {
        type            fixedValue;
	value           uniform 0; 
    }

    top
    {
        type            slip;
    }
    
    piston
    {       
        type            codedFixedValue;
    	value           uniform 0;
    	name    pistonUx;
    	code
    	#{
          const scalar& t = this->db().time().timeOutputValue();
 
          scalar f = 32.; //Hz
          scalar alpha = 12e-3; // m
          scalar omega = 2.*M_PI*f; // rad/s
          
          operator==( omega*alpha * cos(omega*t) );
          
   	#};
    }
    
    shaft
    {
        type            slip;
    }

    wedge0
    {
        type            wedge;
    }
    
    wedge1
    {
        type            wedge;
    }
}

// ************************************************************************* //
